      *COBOL Copybook
      *
      *DADOS DO VENDEDOR
      * 
         05 FD-COD-VENDEDOR           PIC  9(07).
         05 FD-CPF                    PIC  9(14).
         05 FD-NOME                   PIC  X(40).
         05 FD-LATITUDE-VEN           PIC S9(03)V9(08).
         05 FD-LONGITUDE-VEN          PIC S9(03)V9(08).